// @flow

import type { OptionItem } from '../types/OptionItem';

const locks: Array<OptionItem> = [
  {
    text: 'Гардиан 32.15',
    value: '11',
  },
  {
    text: 'Гардиан 32.01 + 3 боченка',
    value: '12',
  },
  {
    text: '1 ригельный (+электрозащелка)',
    value: '13',
  },
  {
    text: '1 ригельный (+регулятор язычка) + Невидимка',
    value: '14',
  },
  {
    text: '1 ригельный (+электрозащелка) + Невидимка',
    value: '15',
  },
  {
    text: '1 ригельный (+электрозащелка) + Панель вызова',
    value: '16',
  },
  {
    text: '1 ригельный (+электрозащелка) + RFID-считка',
    value: '17',
  },
  {
    text: '1 ригельный (+электрозащелка) + BIO-считка',
    value: '18',
  },
  {
    text: 'Гардиан 32.15 + Гардиан 30.01',
    value: '21',
  },
  {
    text: 'Гардиан 32.01 + Гардиан 30.01 + 3 боченка',
    value: '22',
  },
  {
    text: '2 ригельных (+регулятор на нижнем) + Невидимка',
    value: '23',
  },
  {
    text: '2 ригельных (+электрозащелка) + Невидимка',
    value: '24',
  },
  {
    text: '2 ригельных (+электрозащелка) + Панель вызова',
    value: '25',
  },
  {
    text: '2 ригельных (+электрозащелка) + RFID-считка',
    value: '26',
  },
  {
    text: '2 ригельных (+электрозащелка) + BIO-считка',
    value: '27',
  },
  {
    text: '1 электромагнит ML350',
    value: '31',
  },
  {
    text: '2 электромагнита ML250',
    value: '32',
  },
  {
    text: '1 сдвиговый электромагнит',
    value: '33',
  },
  {
    text: '1 электрозадвижка (дэдболт)',
    value: '34',
  },
  {
    text: '1 кодово-механический',
    value: '41',
  },
  {
    text: '1 нажимная защелка',
    value: '42',
  },
  {
    text: '1 защелка-бочонок',
    value: '43',
  },
];

export default locks;
