// @flow

import type { OptionItem } from '../types/OptionItem';

const materialColor: Array<OptionItem> = [
  {
    text: 'Нет Элемента',
    value: '100',
  },
  {
    text: 'Антрацит муар RAL 7016',
    value: '101',
  },
  {
    text: 'Черный муар RAL9005',
    value: '102',
  },
  {
    text: 'Черный глянец RAL9005',
    value: '103',
  },
  {
    text: 'Коричнево-красный матовый RAL3011',
    value: '104',
  },
  {
    text: 'Перламутрово-рубиновый матовый RAL3032',
    value: '105',
  },
  {
    text: 'Стальной синий матовый RAL5011',
    value: '106',
  },
  {
    text: 'Кобальтово-синий матовый RAL5013',
    value: '107',
  },
  {
    text: 'Зеленый мох матовый RAL6005',
    value: '108',
  },
  {
    text: 'Графитовый серый матовый RAL7024',
    value: '109',
  },
  {
    text: 'Шоколадно-коричневый матовый RAL8017',
    value: '110',
  },
  {
    text: 'Терракотовый матовый RAL8028',
    value: '111',
  },
  {
    text: 'Белый муар RAL9010',
    value: '112',
  },
  {
    text: 'Белый глянец RAL9010',
    value: '113',
  },
  {
    text: 'Серо-зеленый RAL7022',
    value: '114',
  },
  {
    text: 'Серый RAL 7011',
    value: '115',
  },
  {
    text: 'Светло-серый RAL7040',
    value: '116',
  },
  {
    text: 'Коричневый муар RAL8019',
    value: '117',
  },
  {
    text: 'Ваниль матовый RAL1015',
    value: '118',
  },
  {
    text: 'Муар графит с отливом YW359F',
    value: '151',
  },
  {
    text: 'Муар темно-синий с отливом YW353F',
    value: '152',
  },
  {
    text: 'Муар антрацит с отливом YW361F',
    value: '153',
  },
  {
    text: 'Муар серо-каменная рябь YX353F',
    value: '154',
  },
  {
    text: 'Муар коричневый с отливом YW366F',
    value: '155',
  },
  {
    text: 'Муар бежевый YW370F',
    value: '156',
  },
  {
    text: 'Муар темно бордовый с отливом Yx310i',
    value: '157',
  },
  {
    text: 'Муар брызги шампанского Y2317F',
    value: '158',
  },
  {
    text: 'Муар стальной металлик с отливом YW213G',
    value: '159',
  },
  {
    text: 'Муар темно-зеленый с отливом YW354F',
    value: '160',
  },
  {
    text: 'Муар черный кофе RAL9005',
    value: '161',
  },
  {
    text: 'Муар антрацит RAL7016',
    value: '162',
  },
  {
    text: 'Муар ванильный RAL1015',
    value: '163',
  },
  {
    text: 'Темный графит RAL7021HR',
    value: '164',
  },
  {
    text: 'Муар коричневый RAL PF68781R',
    value: '165',
  },
];

export default materialColor;
